================================================================================
Module
================================================================================
module Foo;
--------------------------------------------------------------------------------

(module
  (module_decl
    (ident
      (name))))

================================================================================
Import
================================================================================
import Foo;
--------------------------------------------------------------------------------

(module
  (import
    (ident
      (name))))

================================================================================
Set add
================================================================================

add s1[12];
add s2[s3];

--------------------------------------------------------------------------------

(module
  (statement
    (expression
      (set_add
        (ident
          (name))
        (expression
          (integer)))))
  (statement
    (expression
      (set_add
        (ident
          (name))
        (expression
          (ident
            (name)))))))

================================================================================
Local variable
================================================================================

{
local f2 = "-";
}

--------------------------------------------------------------------------------

(module
  (statement
    (block
      (var_decl
        (linkage)
        (ident
          (name))
        (expression
          (string))))))

================================================================================
Throw
================================================================================

throw "123";

--------------------------------------------------------------------------------

(module
  (statement
    (throw_
      (expression
        (string)))))

===
Delete
===

delete xs[x];

---

(module
  (statement
    (delete
      (array_access
        (expression
          (ident
            (name)))
        (expression
          (ident
            (name)))))))
