================================================================================
Type declaration
================================================================================
type X = tuple<A, B>;

type X = bitfield(8) {
    a: 0..7;
};
--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (typename
      (ident
        (name))
      (typename
        (ident
          (name)))
      (typename
        (ident
          (name)))))
  (type_decl
    (ident
      (name))
    (typename
      (bitfield
        (integer)
        (bitfield_field
          (ident
            (name))
          (integer)
          (integer))))))

================================================================================
Bitfield with literal values
================================================================================

type X = bitfield(8) {
  a: 0..7 = 2;
};

--------------------------------------------------------------------------------

(module
  entities: (type_decl
    name: (ident
      (name))
    (typename
      (bitfield
        (integer)
        (bitfield_field
          name: (ident
            (name))
          (integer)
          (integer)
          value: (expression
            (integer)))))))

================================================================================
Bitfield with attribute
================================================================================

type X = unit {
  : bitfield(8) {
    a: 0..7 = 2;
  } &bit-order=spicy::BitOrder::MSB0;
};

type X = bitfield(8) {
  a: 0..7 = 2;
} &bit-order=spicy::BitOrder::MSB0;
--------------------------------------------------------------------------------

(module
  entities: (type_decl
    name: (ident
      (name))
    field: (field_decl
      type_: (typename
        (bitfield
          (integer)
          (bitfield_field
            name: (ident
              (name))
            (integer)
            (integer)
            value: (expression
              (integer)))))
      attributes: (attribute
        attribute_name: (attribute_name)
        attribute_value: (expression
          (ident
            (name)
            (ident
              (name)
              (ident
                (name))))))))
  entities: (type_decl
    name: (ident
      (name))
    (typename
      (bitfield
        (integer)
        (bitfield_field
          name: (ident
            (name))
          (integer)
          (integer)
          value: (expression
            (integer)))))
    (attribute
      attribute_name: (attribute_name)
      attribute_value: (expression
        (ident
          (name)
          (ident
            (name)
            (ident
              (name))))))))

================================================================================
Tuple with named fields
================================================================================
global tu: tuple<a: int32, string, c: bool> = (1, "2", True);
--------------------------------------------------------------------------------

(module
  (var_decl
    (linkage)
    (ident
      (name))
    (typename
      (ident
        (name))
      (ident
        (name))
      (typename
        (ident
          (name)))
      (typename
        (ident
          (name)))
      (ident
        (name))
      (typename
        (ident
          (name))))
    (expression
      (tuple
        (expression
          (integer))
        (expression
          (string))
        (expression
          (boolean))))))
