================================================================================
Unit parameters
================================================================================
type X = unit(z: uint8) {
    x: X(z);
};
--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (params
      (ident
        (name))
      (typename
        (ident
          (name))))
    (field_decl
      (ident
        (name))
      (typename
        (ident
          (name)))
      (expression
        (ident
          (name))))))

================================================================================
Unit var
================================================================================
type A = unit {
    var x: uint8;
    var x: bytes &optional;
};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (var_decl
      (linkage)
      (ident
        (name))
      (typename
        (ident
          (name))))
    (var_decl
      (linkage)
      (ident
        (name))
      (typename
        (ident
          (name)))
      (optional))))

================================================================================
Unit properties
================================================================================
type A = unit {
  %mime-type = "foo/bar";
  %port = 8080;
  %port = 100/tcp &originator;
};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (property
      (property_name)
      (expression
        (string)))
    (property
      (property_name)
      (expression
        (integer)))
    (property
      (property_name)
      (expression
        (port))
      (attribute
        (attribute_name)))))

================================================================================
Vector field
================================================================================

type Test = unit {
    a: b"XXX"[2];
    b: LINE[4/2];
    c: (uint8(42))[];
    d: uint8[];
    d: A()[];
};
--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (field_decl
      (ident
        (name))
      (vector
        (bytes)
        (expression
          (integer))))
    (field_decl
      (ident
        (name))
      (vector
        (typename
          (ident
            (name)))
        (expression
          (binary_op
            (expression
              (integer))
            (expression
              (integer))))))
    (field_decl
      (ident
        (name))
      (vector
        (typename
          (ident
            (name)))
        (expression
          (integer))))
    (field_decl
      (ident
        (name))
      (typename
        (ident
          (name))))
    (field_decl
      (ident
        (name))
      (vector
        (typename
          (ident
            (name)))))))

================================================================================
Sink
================================================================================

type Main = unit {
    raw: bytes &eod -> self.data;
    sink data;
};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (field_decl
      (ident
        (name))
      (typename
        (ident
          (name)))
      (attribute
        (attribute_name))
      (expression
        (type_member
          (expression
            (self_id))
          (type_member_ident
            (ident
              (name))))))
    (sink_decl
      (ident
        (name)))))

================================================================================
Sink external
================================================================================

type Main = unit(s: sink&, other: Unit) {
    : bytes &eod -> s;
    : bytes &eod -> other.s;
};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (params
      (ident
        (name))
      (typename
        (ident
          (name)))
      (ident
        (name))
      (typename
        (ident
          (name))))
    (field_decl
      (typename
        (ident
          (name)))
      (attribute
        (attribute_name))
      (expression
        (ident
          (name))))
    (field_decl
      (typename
        (ident
          (name)))
      (attribute
        (attribute_name))
      (expression
        (type_member
          (expression
            (ident
              (name)))
          (type_member_ident
            (ident
              (name))))))))

================================================================================
Hook decl
================================================================================

type Sub = unit {
    s: bytes &eod;

    on %done { print self.s; }
    on %gap(seq: uint64, len: uint64)  { 1; }
    on %skipped(seq: uint64) 2;
    on s { 3; }
};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (field_decl
      (ident
        (name))
      (typename
        (ident
          (name)))
      (attribute
        (attribute_name)))
    (hook_decl
      (hook_name
        (ident))
      (statement
        (block
          (statement
            (print
              (expression
                (type_member
                  (expression
                    (self_id))
                  (type_member_ident
                    (ident
                      (name))))))))))
    (hook_decl
      (hook_name
        (ident))
      (ident
        (name))
      (typename
        (ident
          (name)))
      (ident
        (name))
      (typename
        (ident
          (name)))
      (statement
        (block
          (statement
            (expression
              (integer))))))
    (hook_decl
      (hook_name
        (ident))
      (ident
        (name))
      (typename
        (ident
          (name)))
      (statement
        (expression
          (integer))))
    (hook_decl
      (ident
        (name))
      (statement
        (block
          (statement
            (expression
              (integer))))))))

================================================================================
Foreach hook
================================================================================

type Test = unit {
    on lines foreach {}
    : uint8[] foreach {} {}
    on %done {}
};
--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (hook_decl
      (ident
        (name))
      (foreach
        (block)))
    (field_decl
      (typename
        (ident
          (name)))
      (foreach
        (block))
      (block))
    (hook_decl
      (hook_name
        (ident))
      (statement
        (block)))))

================================================================================
Checked field access
================================================================================

type X = unit {
    f1: uint8 {
        assert self?.f1;
        assert self.?f1;
    }
};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (field_decl
      (ident
        (name))
      (typename
        (ident
          (name)))
      (block
        (statement
          (assert
            (expression
              (type_member_check
                (expression
                  (self_id))
                (ident
                  (name))))))
        (statement
          (assert
            (expression
              (type_member_checked
                (expression
                  (self_id))
                (ident
                  (name))))))))))

================================================================================
Debug hook
================================================================================

type Test = unit {
    a: uint8[] %debug {}
    on %done %debug {}
    on %error(e: string) %debug {}
};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (field_decl
      (ident
        (name))
      (typename
        (ident
          (name)))
      (is_debug)
      (block))
    (hook_decl
      (hook_name
        (ident))
      (is_debug)
      (statement
        (block)))
    (hook_decl
      (hook_name
        (ident))
      (ident
        (name))
      (typename
        (ident
          (name)))
      (is_debug)
      (statement
        (block)))))

================================================================================
External hooks
================================================================================

type test = unit {
    a: bytes &size=4;
};

on test::a {}
--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (field_decl
      (ident
        (name))
      (typename
        (ident
          (name)))
      (attribute
        (attribute_name)
        (expression
          (integer)))))
  (hook_decl
    (ident
      (name)
      (ident
        (name)))
    (statement
      (block))))

================================================================================
Imported hooks
================================================================================

on Mini::Foo::a {}
on Mini::Foo::b {}
on Mini::Foo::%init {}

--------------------------------------------------------------------------------

(module
  (hook_decl
    (ident
      (name)
      (ident
        (name)
        (ident
          (name))))
    (statement
      (block)))
  (hook_decl
    (ident
      (name)
      (ident
        (name)
        (ident
          (name))))
    (statement
      (block)))
  (hook_decl
    (ident
      (name)
      (ident
        (name)))
    (hook_name
      (ident))
    (statement
      (block))))

================================================================================
Hook priorities
================================================================================

type tA = unit {
       a: bytes &size=5 { }
       on a priority=7 { }
};

on tA::a priority=-5 { }
on tA::a priority=15 { }

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (field_decl
      (ident
        (name))
      (typename
        (ident
          (name)))
      (attribute
        (attribute_name)
        (expression
          (integer)))
      (block))
    (hook_decl
      (ident
        (name))
      (hook_priority
        (integer))
      (statement
        (block))))
  (hook_decl
    (ident
      (name)
      (ident
        (name)))
    (hook_priority
      (integer))
    (statement
      (block)))
  (hook_decl
    (ident
      (name)
      (ident
        (name)))
    (hook_priority
      (integer))
    (statement
      (block))))

================================================================================
Vector fields
================================================================================

type Message = unit {
    headers:    (Header(self))[];
};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (field_decl
      (ident
        (name))
      (vector
        (typename
          (ident
            (name)))
        (expression
          (self_id))))))

================================================================================
Unit parameter defaults
================================================================================

type TCAPTag = unit(consume: bool = False) {};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (params
      (ident
        (name))
      (typename
        (ident
          (name)))
      (expression
        (boolean)))))

================================================================================
Unit parameter forward
================================================================================

type T2 = unit(inout t: Test) {
};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (params
      (inout)
      (ident
        (name))
      (typename
        (ident
          (name))))))

================================================================================
Switch
================================================================================

type test1 = unit {
       switch ( self.a ) {
           b"1" ->  {
                       b: bytes &size=1;
                       c: bytes &size=3;
                    }
           b"2" ->  {
                       d: bytes &size=1;
                       e: bytes &size=3;
                    }
           *    -> f: bytes &size=4;
           };
};

type test2 = unit(x: uint8) {
    switch ( self.a ) {
        b"1" -> : uint8;
        b"2" -> : test2(x);
    } &size=2;
};

type test3 = unit {
    switch {
        -> a: A;
    };
};

type test4 = unit {
  switch {
    -> a: A;
  } &eod &size=1; # Multiple attributes.
};
--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (unit_switch
      (expression
        (type_member
          (expression
            (self_id))
          (type_member_ident
            (ident
              (name)))))
      (unit_switch_case
        (expression
          (bytes))
        (field_decl
          (ident
            (name))
          (typename
            (ident
              (name)))
          (attribute
            (attribute_name)
            (expression
              (integer))))
        (field_decl
          (ident
            (name))
          (typename
            (ident
              (name)))
          (attribute
            (attribute_name)
            (expression
              (integer)))))
      (unit_switch_case
        (expression
          (bytes))
        (field_decl
          (ident
            (name))
          (typename
            (ident
              (name)))
          (attribute
            (attribute_name)
            (expression
              (integer))))
        (field_decl
          (ident
            (name))
          (typename
            (ident
              (name)))
          (attribute
            (attribute_name)
            (expression
              (integer)))))
      (unit_switch_case
        (field_decl
          (ident
            (name))
          (typename
            (ident
              (name)))
          (attribute
            (attribute_name)
            (expression
              (integer)))))))
  (type_decl
    (ident
      (name))
    (params
      (ident
        (name))
      (typename
        (ident
          (name))))
    (unit_switch
      (expression
        (type_member
          (expression
            (self_id))
          (type_member_ident
            (ident
              (name)))))
      (unit_switch_case
        (expression
          (bytes))
        (field_decl
          (typename
            (ident
              (name)))))
      (unit_switch_case
        (expression
          (bytes))
        (field_decl
          (typename
            (ident
              (name)))
          (expression
            (ident
              (name)))))
      (attribute
        (attribute_name)
        (expression
          (integer)))))
  (type_decl
    (ident
      (name))
    (unit_switch
      (unit_switch_case
        (field_decl
          (ident
            (name))
          (typename
            (ident
              (name)))))))
  (type_decl
    (ident
      (name))
    (unit_switch
      (unit_switch_case
        (field_decl
          (ident
            (name))
          (typename
            (ident
              (name)))))
      (attribute
        (attribute_name))
      (attribute
        (attribute_name)
        (expression
          (integer))))
    (comment)))

================================================================================
Switch if
================================================================================

type test = unit {
  switch {
      * -> : /./
  } if ( 1 );
};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (unit_switch
      (unit_switch_case
        (field_decl
          (regexp)))
      (expression
        (integer)))))

================================================================================
Switch void
================================================================================

type test = unit {
       switch (1) {
           1 ->  : void {}
       };
};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (unit_switch
      (expression
        (integer))
      (unit_switch_case
        (expression
          (integer))
        (field_decl
          (void)
          (block))))))

================================================================================
Switch multicase
================================================================================

type test = unit {
       switch (1) {
           1, 2,3 ->  : /./;
       };
};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (unit_switch
      (expression
        (integer))
      (unit_switch_case
        (expression
          (integer))
        (expression
          (integer))
        (expression
          (integer))
        (field_decl
          (regexp))))))

================================================================================
Switch nested
================================================================================

type X = unit {
  switch (True) {
    * -> {
      switch (True) {
        * -> x: uint8;
      };
    }
  };
};

# Nested unit switch with lahead.
type test5 = unit {
    switch {
        -> switch {
            -> a: b"a";
            -> b: b"b";
        };
        -> c: b"c";
    };
};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (unit_switch
      (expression
        (boolean))
      (unit_switch_case
        (unit_switch
          (expression
            (boolean))
          (unit_switch_case
            (field_decl
              (ident
                (name))
              (typename
                (ident
                  (name)))))))))
  (comment)
  (type_decl
    (ident
      (name))
    (unit_switch
      (unit_switch_case
        (unit_switch
          (unit_switch_case
            (field_decl
              (ident
                (name))
              (bytes)))
          (unit_switch_case
            (field_decl
              (ident
                (name))
              (bytes)))))
      (unit_switch_case
        (field_decl
          (ident
            (name))
          (bytes))))))

================================================================================
Field types w/ parse attributes
================================================================================

type Foo = unit {
    x: (bytes &parse-from=b"abc")[3];
    y: (bytes &size=2)[];
};
--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (field_decl
      (ident
        (name))
      (vector
        (typename
          (ident
            (name)))
        (attribute
          (attribute_name)
          (expression
            (bytes)))
        (expression
          (integer))))
    (field_decl
      (ident
        (name))
      (vector
        (typename
          (ident
            (name)))
        (attribute
          (attribute_name)
          (expression
            (integer)))))))

================================================================================
Skip fields
================================================================================

public type Foo = unit {
    : skip bytes &eod;
    : bytes &eod;
};

--------------------------------------------------------------------------------

(module
  entities: (type_decl
    (visibility)
    name: (ident
      (name))
    field: (field_decl
      skip: (is_skip)
      type_: (typename
        (ident
          (name)))
      attributes: (attribute
        attribute_name: (attribute_name)))
    field: (field_decl
      type_: (typename
        (ident
          (name)))
      attributes: (attribute
        attribute_name: (attribute_name)))))

================================================================================
Unit attributes
================================================================================

type Foo = unit {
} &max-size=1 &size=2;

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (attribute
      (attribute_name)
      (expression
        (integer)))
    (attribute
      (attribute_name)
      (expression
        (integer)))))

================================================================================
Conditional fields
================================================================================

type X = unit {
  : bytes &size=1 if (True);
};

--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (field_decl
      (typename
        (ident
          (name)))
      (attribute
        (attribute_name)
        (expression
          (integer)))
      (expression
        (boolean)))))

================================================================================
Bitfield
================================================================================

type Foo = unit {
: bitfield(16) {
    a: 0..8;
    b: 9..15;
} {}
};
--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (field_decl
      (typename
        (bitfield
          (integer)
          (bitfield_field
            (ident
              (name))
            (integer)
            (integer))
          (bitfield_field
            (ident
              (name))
            (integer)
            (integer))))
      (block))))

================================================================================
Context
================================================================================

module test;

type Context = int32;

public type P = unit(p: uint8) {
    %context = Context;

    x: uint8 &requires=$$==1 &convert=p;
};

public type X = unit() {
    p: P(42);
};
--------------------------------------------------------------------------------

(module
  (module_decl
    (ident
      (name)))
  (type_decl
    (ident
      (name))
    (typename
      (ident
        (name))))
  (type_decl
    (visibility)
    (ident
      (name))
    (params
      (ident
        (name))
      (typename
        (ident
          (name))))
    (property
      (property_name)
      (expression
        (ident
          (name))))
    (field_decl
      (ident
        (name))
      (typename
        (ident
          (name)))
      (attribute
        (attribute_name)
        (expression
          (binary_op
            (expression
              (dd))
            (expression
              (integer)))))
      (attribute
        (attribute_name)
        (expression
          (ident
            (name))))))
  (type_decl
    (visibility)
    (ident
      (name))
    (params)
    (field_decl
      (ident
        (name))
      (typename
        (ident
          (name)))
      (expression
        (integer)))))

================================================================================
Default value
================================================================================
module foo;
type X = unit {
  var x: uint8 &default=42;
};
--------------------------------------------------------------------------------

(module
  (module_decl
    (ident
      (name)))
  (type_decl
    (ident
      (name))
    (var_decl
      (linkage)
      (ident
        (name))
      (typename
        (ident
          (name)))
      (attribute
        (attribute_name)
        (expression
          (integer))))))

================================================================================
Struct init
================================================================================
global x: X = [$a = 1, $b = 2];
--------------------------------------------------------------------------------

(module
  (var_decl
    (linkage)
    (ident
      (name))
    (typename
      (ident
        (name)))
    (expression
      (struct_ctr
        (struct_ctr_id)
        (expression
          (integer))
        (struct_ctr_id)
        (expression
          (integer))))))

================================================================================
Lists w/ bracketed type and dynamic width
================================================================================
type X = unit { xs: (ABC)[len]; };
--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (field_decl
      (ident
        (name))
      (vector
        (typename
          (ident
            (name)))
        (expression
          (ident
            (name)))))))

================================================================================
List w/ element type attributes
================================================================================
type X = unit {
    xs: (/(A|B|C)/ &synchronize)[];
};
--------------------------------------------------------------------------------

(module
  (type_decl
    (ident
      (name))
    (field_decl
      (ident
        (name))
      (vector
        (regexp)
        (attribute
          (attribute_name))))))
