================================================================================
Function return
================================================================================

function f() {
    i += 1;
    return;
}

function g() : int64 {
    return 42;
}

--------------------------------------------------------------------------------

(module
  (function_decl
    (ident
      (name))
    (block
      (statement
        (expression
          (assign
            (expression
              (ident
                (name)))
            (expression
              (integer)))))
      (statement
        (return))))
  (function_decl
    (ident
      (name))
    (typename
      (ident
        (name)))
    (block
      (statement
        (return
          (expression
            (integer)))))))

================================================================================
Function attribute
================================================================================

function foo(x: uint8) &cxxname="foo" {}

--------------------------------------------------------------------------------

(module
  (function_decl
    (ident
      (name))
    (function_arg
      (ident
        (name))
      (typename
        (ident
          (name))))
    (attribute
      (attribute_name)
      (expression
        (string)))
    (block)))

================================================================================
Function parameter inout specifier
================================================================================

function foo(x: uint8, inout y: uint8, inout z: uint8) {}

--------------------------------------------------------------------------------

(module
  (function_decl
    (ident
      (name))
    (function_arg
      (ident
        (name))
      (typename
        (ident
          (name))))
    (function_arg
      (inout)
      (ident
        (name))
      (typename
        (ident
          (name))))
    (function_arg
      (inout)
      (ident
        (name))
      (typename
        (ident
          (name))))
    (block)))

================================================================================
Function arg default value
================================================================================

function foo(x: uint8, y: uint8 = 0) {}

--------------------------------------------------------------------------------

(module
  (function_decl
    (ident
      (name))
    (function_arg
      (ident
        (name))
      (typename
        (ident
          (name))))
    (function_arg
      (ident
        (name))
      (typename
        (ident
          (name)))
      (expression
        (integer)))
    (block)))
